Revit 2027 API
ParameterTypeId.FabricSheetMajorLayoutPattern Property
 "Major Layout Pattern": Major Layout Pattern
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricSheetMajorLayoutPattern { get; }
Public Shared ReadOnly Property FabricSheetMajorLayoutPattern As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricSheetMajorLayoutPattern {
	ForgeTypeId^ get ();
}
static member FabricSheetMajorLayoutPattern : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace